{"class_name": "Model", "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "name": "input_2", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 48}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "dense_2"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_3"}}