{"loss": "mse", "optimizer": {"epsilon": 1e-08, "lr": 1.0, "name": "Adadelta", "rho": 0.95}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 48], "name": "input_7", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_7"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 16}, "inbound_nodes": [[["input_7", 0, 0]]], "name": "dense_7"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 48}, "inbound_nodes": [[["dense_7", 0, 0]]], "name": "dense_8"}], "input_layers": [["input_7", 0, 0]], "output_layers": [["dense_8", 0, 0]], "name": "model_10"}, "sample_weight_mode": null}