{"loss": "mse", "optimizer": {"epsilon": 1e-08, "lr": 1.0, "name": "Adadelta", "rho": 0.95}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "name": "input_11", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_11"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_11", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 64}, "inbound_nodes": [[["input_11", 0, 0]]], "name": "dense_11"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_12", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["dense_11", 0, 0]]], "name": "dense_12"}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_12", 0, 0]], "name": "model_16"}, "sample_weight_mode": null}