{"class_name": "Model", "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "name": "input_4", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "dense_4"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_6"}}