{"loss": "mse", "optimizer": {"epsilon": 1e-08, "lr": 1.0, "name": "Adadelta", "rho": 0.95}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "name": "input_9", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 16}, "inbound_nodes": [[["input_9", 0, 0]]], "name": "dense_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 16}, "inbound_nodes": [[["dense_9", 0, 0]]], "name": "dense_10"}], "input_layers": [["input_9", 0, 0]], "output_layers": [["dense_10", 0, 0]], "name": "model_13"}, "sample_weight_mode": null}