{"class_name": "Model", "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "name": "input_3", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 8}, "inbound_nodes": [[["input_3", 0, 0]]], "name": "dense_3"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "model_5"}}